## Question 02

对比同一个程序在 ELF 目标文件形式下，以及被加载至内核后，分别执行 `bpftool btf dump file` 和 `bpftool btf dump prog` 命令得到的输出结果。这两份输出应当是完全一致的。

## Answer


1. 运行 

```sh
$ cd chapter5
$ ./hello-buffer-config
```

2. btf dump file

<details>
<summary>$ bpftool btf dump file hello-buffer-config.bpf.o</summary>

```sh
[1] PTR '(anon)' type_id=3
[2] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=4
[4] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] STRUCT '(anon)' size=24 vlen=3
        'type' type_id=1 bits_offset=0
        'key_size' type_id=1 bits_offset=64
        'value_size' type_id=1 bits_offset=128
[6] VAR 'output' type_id=5, linkage=global
[7] PTR '(anon)' type_id=8
[8] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=1
[9] PTR '(anon)' type_id=10
[10] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=10240
[11] PTR '(anon)' type_id=12
[12] TYPEDEF 'u32' type_id=13
[13] TYPEDEF '__u32' type_id=14
[14] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
[15] PTR '(anon)' type_id=16
[16] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=18 bits_offset=0
[17] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[18] ARRAY '(anon)' type_id=17 index_type_id=4 nr_elems=12
[19] STRUCT '(anon)' size=32 vlen=4
        'type' type_id=7 bits_offset=0
        'max_entries' type_id=9 bits_offset=64
        'key' type_id=11 bits_offset=128
        'value' type_id=15 bits_offset=192
[20] VAR 'my_config' type_id=19, linkage=global
[21] PTR '(anon)' type_id=22
[22] STRUCT 'pt_regs' size=168 vlen=21
        'r15' type_id=23 bits_offset=0
        'r14' type_id=23 bits_offset=64
        'r13' type_id=23 bits_offset=128
        'r12' type_id=23 bits_offset=192
        'bp' type_id=23 bits_offset=256
        'bx' type_id=23 bits_offset=320
        'r11' type_id=23 bits_offset=384
        'r10' type_id=23 bits_offset=448
        'r9' type_id=23 bits_offset=512
        'r8' type_id=23 bits_offset=576
        'ax' type_id=23 bits_offset=640
        'cx' type_id=23 bits_offset=704
        'dx' type_id=23 bits_offset=768
        'si' type_id=23 bits_offset=832
        'di' type_id=23 bits_offset=896
        'orig_ax' type_id=23 bits_offset=960
        'ip' type_id=23 bits_offset=1024
        '(anon)' type_id=24 bits_offset=1088
        'flags' type_id=23 bits_offset=1152
        'sp' type_id=23 bits_offset=1216
        '(anon)' type_id=32 bits_offset=1280
[23] INT 'unsigned long' size=8 bits_offset=0 nr_bits=64 encoding=(none)
[24] UNION '(anon)' size=8 vlen=3
        'cs' type_id=25 bits_offset=0
        'csx' type_id=28 bits_offset=0
        'fred_cs' type_id=31 bits_offset=0
[25] TYPEDEF 'u16' type_id=26
[26] TYPEDEF '__u16' type_id=27
[27] INT 'unsigned short' size=2 bits_offset=0 nr_bits=16 encoding=(none)
[28] TYPEDEF 'u64' type_id=29
[29] TYPEDEF '__u64' type_id=30
[30] INT 'unsigned long long' size=8 bits_offset=0 nr_bits=64 encoding=(none)
[31] STRUCT 'fred_cs' size=8 vlen=3
        'cs' type_id=28 bits_offset=0 bitfield_size=16
        'sl' type_id=28 bits_offset=16 bitfield_size=2
        'wfe' type_id=28 bits_offset=18 bitfield_size=1
[32] UNION '(anon)' size=8 vlen=3
        'ss' type_id=25 bits_offset=0
        'ssx' type_id=28 bits_offset=0
        'fred_ss' type_id=33 bits_offset=0
[33] STRUCT 'fred_ss' size=8 vlen=10
        'ss' type_id=28 bits_offset=0 bitfield_size=16
        'sti' type_id=28 bits_offset=16 bitfield_size=1
        'swevent' type_id=28 bits_offset=17 bitfield_size=1
        'nmi' type_id=28 bits_offset=18 bitfield_size=1
        'vector' type_id=28 bits_offset=32 bitfield_size=8
        'type' type_id=28 bits_offset=48 bitfield_size=4
        'enclave' type_id=28 bits_offset=56 bitfield_size=1
        'lm' type_id=28 bits_offset=57 bitfield_size=1
        'nested' type_id=28 bits_offset=58 bitfield_size=1
        'insnlen' type_id=28 bits_offset=60 bitfield_size=4
[34] FUNC_PROTO '(anon)' ret_type_id=2 vlen=1
        'ctx' type_id=21
[35] FUNC 'hello' type_id=34 linkage=global
[36] VAR 'message' type_id=18, linkage=global
[37] INT '_Bool' size=1 bits_offset=0 nr_bits=8 encoding=BOOL
[38] VAR 'LINUX_HAS_SYSCALL_WRAPPER' type_id=37, linkage=extern
[39] ARRAY '(anon)' type_id=17 index_type_id=4 nr_elems=13
[40] VAR 'LICENSE' type_id=39, linkage=global
[41] DATASEC '.data' size=0 vlen=1
        type_id=36 offset=0 size=12 (VAR 'message')
[42] DATASEC '.kconfig' size=0 vlen=1
        type_id=38 offset=0 size=1 (VAR 'LINUX_HAS_SYSCALL_WRAPPER')
[43] DATASEC '.maps' size=0 vlen=2
        type_id=6 offset=0 size=24 (VAR 'output')
        type_id=20 offset=0 size=32 (VAR 'my_config')
[44] DATASEC 'license' size=0 vlen=1
        type_id=40 offset=0 size=13 (VAR 'LICENSE')
```

</details>

3. btf dump prog

<details>
<summary>$ bpftool btf dump prog id 44</summary>

```sh

[1] PTR '(anon)' type_id=3
[2] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
[3] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=4
[4] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
[5] STRUCT '(anon)' size=24 vlen=3
        'type' type_id=1 bits_offset=0
        'key_size' type_id=1 bits_offset=64
        'value_size' type_id=1 bits_offset=128
[6] VAR 'output' type_id=5, linkage=global
[7] PTR '(anon)' type_id=8
[8] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=1
[9] PTR '(anon)' type_id=10
[10] ARRAY '(anon)' type_id=2 index_type_id=4 nr_elems=10240
[11] PTR '(anon)' type_id=12
[12] TYPEDEF 'u32' type_id=13
[13] TYPEDEF '__u32' type_id=14
[14] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
[15] PTR '(anon)' type_id=16
[16] STRUCT 'user_msg_t' size=12 vlen=1
        'message' type_id=18 bits_offset=0
[17] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
[18] ARRAY '(anon)' type_id=17 index_type_id=4 nr_elems=12
[19] STRUCT '(anon)' size=32 vlen=4
        'type' type_id=7 bits_offset=0
        'max_entries' type_id=9 bits_offset=64
        'key' type_id=11 bits_offset=128
        'value' type_id=15 bits_offset=192
[20] VAR 'my_config' type_id=19, linkage=global
[21] PTR '(anon)' type_id=22
[22] STRUCT 'pt_regs' size=168 vlen=21
        'r15' type_id=23 bits_offset=0
        'r14' type_id=23 bits_offset=64
        'r13' type_id=23 bits_offset=128
        'r12' type_id=23 bits_offset=192
        'bp' type_id=23 bits_offset=256
        'bx' type_id=23 bits_offset=320
        'r11' type_id=23 bits_offset=384
        'r10' type_id=23 bits_offset=448
        'r9' type_id=23 bits_offset=512
        'r8' type_id=23 bits_offset=576
        'ax' type_id=23 bits_offset=640
        'cx' type_id=23 bits_offset=704
        'dx' type_id=23 bits_offset=768
        'si' type_id=23 bits_offset=832
        'di' type_id=23 bits_offset=896
        'orig_ax' type_id=23 bits_offset=960
        'ip' type_id=23 bits_offset=1024
        '(anon)' type_id=24 bits_offset=1088
        'flags' type_id=23 bits_offset=1152
        'sp' type_id=23 bits_offset=1216
        '(anon)' type_id=32 bits_offset=1280
[23] INT 'unsigned long' size=8 bits_offset=0 nr_bits=64 encoding=(none)
[24] UNION '(anon)' size=8 vlen=3
        'cs' type_id=25 bits_offset=0
        'csx' type_id=28 bits_offset=0
        'fred_cs' type_id=31 bits_offset=0
[25] TYPEDEF 'u16' type_id=26
[26] TYPEDEF '__u16' type_id=27
[27] INT 'unsigned short' size=2 bits_offset=0 nr_bits=16 encoding=(none)
[28] TYPEDEF 'u64' type_id=29
[29] TYPEDEF '__u64' type_id=30
[30] INT 'unsigned long long' size=8 bits_offset=0 nr_bits=64 encoding=(none)
[31] STRUCT 'fred_cs' size=8 vlen=3
        'cs' type_id=28 bits_offset=0 bitfield_size=16
        'sl' type_id=28 bits_offset=16 bitfield_size=2
        'wfe' type_id=28 bits_offset=18 bitfield_size=1
[32] UNION '(anon)' size=8 vlen=3
        'ss' type_id=25 bits_offset=0
        'ssx' type_id=28 bits_offset=0
        'fred_ss' type_id=33 bits_offset=0
[33] STRUCT 'fred_ss' size=8 vlen=10
        'ss' type_id=28 bits_offset=0 bitfield_size=16
        'sti' type_id=28 bits_offset=16 bitfield_size=1
        'swevent' type_id=28 bits_offset=17 bitfield_size=1
        'nmi' type_id=28 bits_offset=18 bitfield_size=1
        'vector' type_id=28 bits_offset=32 bitfield_size=8
        'type' type_id=28 bits_offset=48 bitfield_size=4
        'enclave' type_id=28 bits_offset=56 bitfield_size=1
        'lm' type_id=28 bits_offset=57 bitfield_size=1
        'nested' type_id=28 bits_offset=58 bitfield_size=1
        'insnlen' type_id=28 bits_offset=60 bitfield_size=4
[34] FUNC_PROTO '(anon)' ret_type_id=2 vlen=1
        'ctx' type_id=21
[35] FUNC 'hello' type_id=34 linkage=global
[36] VAR 'message' type_id=18, linkage=global
[37] INT '_Bool' size=1 bits_offset=0 nr_bits=8 encoding=BOOL
[38] VAR 'LINUX_HAS_SYSCALL_WRAPPER' type_id=37, linkage=global
[39] ARRAY '(anon)' type_id=17 index_type_id=4 nr_elems=13
[40] VAR 'LICENSE' type_id=39, linkage=global
[41] DATASEC '.data' size=12 vlen=1
        type_id=36 offset=0 size=12 (VAR 'message')
[42] DATASEC '.kconfig' size=1 vlen=1
        type_id=38 offset=0 size=1 (VAR 'LINUX_HAS_SYSCALL_WRAPPER')
[43] DATASEC '.maps' size=56 vlen=2
        type_id=6 offset=0 size=24 (VAR 'output')
        type_id=20 offset=24 size=32 (VAR 'my_config')
[44] DATASEC 'license' size=13 vlen=1
        type_id=40 offset=0 size=13 (VAR 'LICENSE')
```